# Data Transformation in Pandas

In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.3'

In [3]:
df = pd.read_csv('data2.csv')

In [4]:
df

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [5]:
df.sort_values("Year")

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
7,Hrithik Roshan,War,2019,Action,475,6.5
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2

In [6]:
df.sort_values("Year", ascending=False)

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
2,Aamir Khan,Dangal,2016,Biography,2024,8.4

In [7]:
df2 = df.sort_values(["Year", "IMDb"]).copy()

In [8]:
#df2.reset_index(drop=True, inplace=True) #Drop: Not generate a new index column, inplace = change into the orginal dataset

In [9]:
df2 #Changes has been occured using inplace=True

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2

In [10]:
df2.sort_index() #sort by index

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [11]:
df2["Rank"] = df2["IMDb"].rank(ascending=False, method="dense")

In [12]:
df2

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb,Rank
2,Aamir Khan,Dangal,2016,Biography,2024,8.4,1.0
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0,9.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1,8.0
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0,6.0
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5,4.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3,2.0
7,Hrithik Roshan,War,2019,Action,475,6.5,7.0
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0,6.0
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2,3.0
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6,11.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9,10.0
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2,5.0

In [13]:
df2.sort_values(["Rank"])

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb,Rank
2,Aamir Khan,Dangal,2016,Biography,2024,8.4,1.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3,2.0
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2,3.0
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5,4.0
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2,5.0
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0,6.0
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0,6.0
7,Hrithik Roshan,War,2019,Action,475,6.5,7.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1,8.0
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0,9.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9,10.0
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6,11.0

In [14]:
df2.rename(columns={"Film" : "Film/Movie"}, inplace=True)

In [15]:
df2.sort_values(["Rank"])

,Actor,Film/Movie,Year,Genre,BoxOffice(INR Crore),IMDb,Rank
2,Aamir Khan,Dangal,2016,Biography,2024,8.4,1.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3,2.0
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2,3.0
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5,4.0
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2,5.0
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0,6.0
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0,6.0
7,Hrithik Roshan,War,2019,Action,475,6.5,7.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1,8.0
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0,9.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9,10.0
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6,11.0

In [16]:
df2 = df2[["Film/Movie","Actor","Year","Genre", "IMDb", "BoxOffice(INR Crore)"]]

In [17]:
df2

,Film/Movie,Actor,Year,Genre,IMDb,BoxOffice(INR Crore)
2,Dangal,Aamir Khan,2016,Biography,8.4,2024
1,Tiger Zinda Hai,Salman Khan,2017,Action,6.0,565
10,Badrinath Ki Dulhania,Varun Dhawan,2017,Romantic Comedy,6.1,201
4,Padmaavat,Ranveer Singh,2018,Historical,7.0,585
6,Stree,Rajkummar Rao,2018,Horror Comedy,7.5,180
5,Andhadhun,Ayushmann Khurrana,2018,Thriller,8.3,111
7,War,Hrithik Roshan,2019,Action,6.5,475
8,Good Newwz,Akshay Kumar,2019,Comedy,7.0,318
11,Uri: The Surgical Strike,Vicky Kaushal,2019,Action,8.2,342
3,Brahmastra,Ranbir Kapoor,2022,Fantasy,5.6,431
9,Bhool Bhulaiyaa 2,Kartik Aaryan,2022,Horror Comedy,5.9,266
0,Pathaan,Shah Rukh Khan,2023,Action,7.2,1050

In [18]:
cols = ["Actor"] + [col for col in df.columns if col != "Actor"]
df = df[cols]

In [19]:
df

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [20]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}
df3 = pd.DataFrame(data)
df3

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [21]:
melt_form = df3.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score")

In [22]:
melt_form

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [23]:
pivot_form = melt_form.pivot(index="Name", columns="Subject", values="Score")
pivot_form

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

## Exaple of pivot_table() to handle duplicates:
Suppose the DataFrame is having two Alice or Bob, with this sense we will using below addiotional (aggfunc="mean") to take mean for duplicate entries. 

For Example: 
If Alice give twice Math's paper, Paper1 = 80 and Paper2=85 then mean value will be 82.5 mark in just one column of Math represent both data point mean

In [24]:
import pandas as pd

df4 = pd.DataFrame(
    [
        ["Alice", 85, 80, 90, 88],      
        ["Bob",   78, 78, 82, 85],
        ["Charlie", 92, 92, 89, 94]
    ],
    columns=["Name", "Math", "Math", "Science", "English"]  
)

print(df4)

      Name  Math  Math  Science  English
0    Alice    85    80       90       88
1      Bob    78    78       82       85
2  Charlie    92    92       89       94

In [25]:
melt_form1 = df4.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score")

In [26]:
melt_form1

       Name  Subject  Score
0     Alice     Math     85
1       Bob     Math     78
2   Charlie     Math     92
3     Alice     Math     80
4       Bob     Math     78
5   Charlie     Math     92
6     Alice  Science     90
7       Bob  Science     82
8   Charlie  Science     89
9     Alice  English     88
10      Bob  English     85
11  Charlie  English     94

In [27]:
pivot_form2 = melt_form1.pivot_table(index="Name", columns="Subject", values="Score", aggfunc="mean")
pivot_form2

Subject  English  Math  Science
Name
Alice       88.0  82.5     90.0
Bob         85.0  78.0     82.0
Charlie     94.0  92.0     89.0

# Finance Example : Classic Example

In [28]:
import pandas as pd

In [29]:
pd.__version__

'2.2.3'

In [30]:
df = pd.read_excel("fin_data.xlsx")
df

,Date,Ticker,Open,High,Low,Close,Volume,Dividend,P/E Ratio,Dividend Yield,Notes
0,2025-01-01,AAPL,150.00,152.5,149.0,151.75,1000000.0,NaN,25.5,0.0033,New year opening
1,2025-01-02,aapl,151.75,153.0,150.5,152.25,1200000.0,0.50,25.8,0.0033,NaN
2,2025-01-03,AAPL,152.25,NaN,151.0,150.75,1100000.0,NaN,NaN,0.0033,Missing high and P/E
3,2025-01-04,MSFT,300.00,305.0,298.0,302.5,800000.0,NaN,28,0.0025,NaN
4,2025-01-05,MSFT,302.50,304.0,300.0,303,NaN,0.75,28.2,NaN,Missing volume and yield
5,2025-01-06,GOOG,2500.00,2520.0,2480.0,2510,500000.0,NaN,22.5,0.0000,No dividend
6,2025-01-07,goog,2510.00,2530.0,2490.0,2520,550000.0,NaN,22.7,0.0000,Inconsistent casing
7,2025-01-08,AAPL,150.75,152.0,149.5,151,1050000.0,NaN,25.6,0.0033,NaN
8,2025-01-09,AAPL,151.00,153.5,150.0,152.75,1150000.0,0.50,25.9,0.0033,Duplicate entry below
9,2025-01-09,AAPL,151.00,153.5,150.0,152.75,1150000.0,0.50,25.9,0.0033,Duplicate entry
10,2025-01-10,TSLA,800.00,820.0,780.0,810,2000000.0,NaN,150,0.0000,Outlier volume?
11,2025-01-11,TSLA,810.00,830.0,790.0,"""820.00""",2100000.0,NaN,"""152.0""",0.0000,Close and P/E as string
12,2025-01-12,AMZN,3000.00,3020.0,2980.0,3010,600000.0,NaN,60,0.0000,NaN
13,2025-01-13,amzn,3010.00,3030.0,2990.0,3020,650000.0,1.00,60.5,0.0003,Unusual dividend for AMZN
14,2025-01-14,FB,200.00,205.0,198.0,202.5,900000.0,NaN,18,0.0000,Different date format
15,2025-01-15,FB,202.50,204.0,200.0,203,950000.0,NaN,18.2,0.0000,Meta ticker old name
16,2025-01-16,META,203.00,205.5,201.0,204.25,1000000.0,NaN,18.4,0.0000,Updated ticker
17,2025-01-17,AAPL,152.75,154.0,151.5,153.25,1250000.0,NaN,26,0.0033,NaN
18,2025-01-18,NaN,153.25,155.0,152.0,154,1300000.0,0.50,26.2,0.0032,Missing ticker
19,2025-01-19,MSFT,303.00,305.5,301.0,304.25,850000.0,NaN,28.5,0.0025,NaN
20,2025-01-20,MSFT,304.25,306.0,302.0,305,900000.0,-0.75,28.7,-0.0025,Negative dividend/yield

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            21 non-null     datetime64[ns]
 1   Ticker          20 non-null     object
 2   Open            21 non-null     float64
 3   High            20 non-null     float64
 4   Low             21 non-null     float64
 5   Close           21 non-null     object
 6   Volume          20 non-null     float64
 7   Dividend        7 non-null      float64
 8   P/E Ratio       20 non-null     object
 9   Dividend Yield  20 non-null     float64
 10  Notes           15 non-null     object
dtypes: datetime64[ns](1), float64(6), object(4)
memory usage: 1.9+ KB

In [32]:
df.describe()

,Date,Open,High,Low,Volume,Dividend,Dividend Yield
count,21,21.000000,20.000000,21.000000,2.000000e+01,7.000000,20.000000
mean,2025-01-10 10:17:08.571428608,745.619048,782.925000,738.738095,1.050000e+06,0.428571,0.001455
min,2025-01-01 00:00:00,150.000000,152.000000,149.000000,5.000000e+05,-0.750000,-0.002500
25%,2025-01-06 00:00:00,152.250000,153.875000,151.000000,8.375000e+05,0.500000,0.000000
50%,2025-01-10 00:00:00,203.000000,254.750000,201.000000,1.000000e+06,0.500000,0.001400
75%,2025-01-15 00:00:00,800.000000,822.500000,780.000000,1.162500e+06,0.625000,0.003300
max,2025-01-20 00:00:00,3010.000000,3030.000000,2990.000000,2.100000e+06,1.000000,0.003300
std,NaN,1022.334322,1046.733821,1014.996535,4.123106e+05,0.553667,0.001820

In [33]:
df.isnull().sum()

Date               0
Ticker             1
Open               0
High               1
Low                0
Close              0
Volume             1
Dividend          14
P/E Ratio          1
Dividend Yield     1
Notes              6
dtype: int64

In [34]:
for col in ['Close', 'P/E Ratio', 'Dividend Yield', 'Dividend']:
    df[col] = pd.to_numeric(df[col], errors='coerce')

df['Dividend'] = df['Dividend'].fillna(0).abs()
df['Dividend Yield'] = df['Dividend Yield'].abs()

df[['High', 'Low', 'Close', 'Volume']] = df.groupby('Ticker')[['High', 'Low', 'Close', 'Volume']].ffill() #Fill missing High/Low/Close/Volume within each stock by carrying forward the last known price.
df['P/E Ratio'] = df.groupby('Ticker')['P/E Ratio'].transform(lambda x: x.fillna(x.mean())) #Fill missing P/E values for a stock using the stocks mean P/E.
df['Dividend Yield'] = df.groupby('Ticker')['Dividend Yield'].transform(lambda x: x.fillna(x.mean())) #Fill missing Dividend Yield values for a stock using the stocks mean Dividend Yield.

print(df.isnull().sum())

Date              0
Ticker            1
Open              0
High              1
Low               1
Close             1
Volume            1
Dividend          0
P/E Ratio         1
Dividend Yield    1
Notes             6
dtype: int64

In [35]:
df

,Date,Ticker,Open,High,Low,Close,Volume,Dividend,P/E Ratio,Dividend Yield,Notes
0,2025-01-01,AAPL,150.00,152.5,149.0,151.75,1000000.0,0.00,25.50,0.0033,New year opening
1,2025-01-02,aapl,151.75,153.0,150.5,152.25,1200000.0,0.50,25.80,0.0033,NaN
2,2025-01-03,AAPL,152.25,152.5,151.0,150.75,1100000.0,0.00,25.78,0.0033,Missing high and P/E
3,2025-01-04,MSFT,300.00,305.0,298.0,302.50,800000.0,0.00,28.00,0.0025,NaN
4,2025-01-05,MSFT,302.50,304.0,300.0,303.00,800000.0,0.75,28.20,0.0025,Missing volume and yield
5,2025-01-06,GOOG,2500.00,2520.0,2480.0,2510.00,500000.0,0.00,22.50,0.0000,No dividend
6,2025-01-07,goog,2510.00,2530.0,2490.0,2520.00,550000.0,0.00,22.70,0.0000,Inconsistent casing
7,2025-01-08,AAPL,150.75,152.0,149.5,151.00,1050000.0,0.00,25.60,0.0033,NaN
8,2025-01-09,AAPL,151.00,153.5,150.0,152.75,1150000.0,0.50,25.90,0.0033,Duplicate entry below
9,2025-01-09,AAPL,151.00,153.5,150.0,152.75,1150000.0,0.50,25.90,0.0033,Duplicate entry
10,2025-01-10,TSLA,800.00,820.0,780.0,810.00,2000000.0,0.00,150.00,0.0000,Outlier volume?
11,2025-01-11,TSLA,810.00,830.0,790.0,810.00,2100000.0,0.00,150.00,0.0000,Close and P/E as string
12,2025-01-12,AMZN,3000.00,3020.0,2980.0,3010.00,600000.0,0.00,60.00,0.0000,NaN
13,2025-01-13,amzn,3010.00,3030.0,2990.0,3020.00,650000.0,1.00,60.50,0.0003,Unusual dividend for AMZN
14,2025-01-14,FB,200.00,205.0,198.0,202.50,900000.0,0.00,18.00,0.0000,Different date format
15,2025-01-15,FB,202.50,204.0,200.0,203.00,950000.0,0.00,18.20,0.0000,Meta ticker old name
16,2025-01-16,META,203.00,205.5,201.0,204.25,1000000.0,0.00,18.40,0.0000,Updated ticker
17,2025-01-17,AAPL,152.75,154.0,151.5,153.25,1250000.0,0.00,26.00,0.0033,NaN
18,2025-01-18,NaN,153.25,NaN,NaN,NaN,NaN,0.50,NaN,NaN,Missing ticker
19,2025-01-19,MSFT,303.00,305.5,301.0,304.25,850000.0,0.00,28.50,0.0025,NaN
20,2025-01-20,MSFT,304.25,306.0,302.0,305.00,900000.0,0.75,28.70,0.0025,Negative dividend/yield

In above example we explore the financial dataset to do some initial data cleaning and preparotory steps before proceeding to use the data further.

## Aggregation & Grouping

Grouping and aggregating helps you **summarize your data**  like answering:  
> Whats the average salary *per department*?  
> How many users joined the Gym *per month*?

In [36]:
import pandas as pd

df = pd.DataFrame({
    "Name": [
        "Alice","Bob","Charlie","Diana","Ethan","Fiona","George","Hannah",
        "Ian","Julia","Kevin","Laura","Michael","Nina","Oscar","Paula",
        "Quentin","Riya","Sam","Tina","Umar","Vera","Walter","Xenia",
        "Yasir","Zara","Adnan","Bella","Cyrus","Dua"
    ],
    "Department": [
        "HR","HR","IT","IT","Marketing","Marketing","Sales","Sales",
        "Finance","Finance","Finance","Operations","Operations","Operations",
        "R&D","R&D","R&D","Admin","Admin","Admin","Logistics","Logistics",
        "Support","Support","Support","Support","Legal","Legal","Legal","Legal"
    ],
    "Team": [
        "A","A","B","B","C","C","D","D","E","E","E","F","F","F",
        "G","G","G","H","H","H","I","I","J","J","J","J","K","K","K","K"
    ],
    "Gender": [
        "M","F","M","F","M","F","M","F","M","F","M","F","M","F",
        "M","F","M","F","M","F","M","F","M","F","M","F","M","F","M","F"
    ],
    "Salary": [
        85,90,78,85,92,88,75,80,95,88,91,72,76,70,110,105,115,68,74,70,
        87,79,66,71,69,73,120,115,118,122
    ],
    "Age": [
        23,25,30,22,28,26,21,27,32,29,31,24,26,23,34,33,35,28,27,25,
        30,31,24,26,25,27,38,36,37,35
    ],
    "JoinDate": pd.to_datetime([
        "2020-01-10","2020-02-15","2021-03-20","2021-04-10",
        "2020-05-30","2020-06-25","2021-07-15","2021-08-01",
        "2020-09-05","2021-01-12","2021-02-18","2020-03-05","2020-04-17",
        "2020-04-28","2021-10-11","2021-11-01","2021-12-14","2020-07-19",
        "2020-08-03","2020-08-20","2021-05-14","2021-06-10","2020-11-25",
        "2020-12-30","2021-01-08","2021-01-22","2022-02-15","2022-03-10",
        "2022-04-05","2022-04-18"
    ])
})

In [37]:
df

       Name  Department Team Gender  Salary  Age   JoinDate
0     Alice          HR    A      M      85   23 2020-01-10
1       Bob          HR    A      F      90   25 2020-02-15
2   Charlie          IT    B      M      78   30 2021-03-20
3     Diana          IT    B      F      85   22 2021-04-10
4     Ethan   Marketing    C      M      92   28 2020-05-30
5     Fiona   Marketing    C      F      88   26 2020-06-25
6    George       Sales    D      M      75   21 2021-07-15
7    Hannah       Sales    D      F      80   27 2021-08-01
8       Ian     Finance    E      M      95   32 2020-09-05
9     Julia     Finance    E      F      88   29 2021-01-12
10    Kevin     Finance    E      M      91   31 2021-02-18
11    Laura  Operations    F      F      72   24 2020-03-05
12  Michael  Operations    F      M      76   26 2020-04-17
13     Nina  Operations    F      F      70   23 2020-04-28
14    Oscar         R&D    G      M     110   34 2021-10-11
15    Paula         R&D    G      F     105   33 2021-11-01
16  Quentin         R&D    G      M     115   35 2021-12-14
17     Riya       Admin    H      F      68   28 2020-07-19
18      Sam       Admin    H      M      74   27 2020-08-03
19     Tina       Admin    H      F      70   25 2020-08-20
20     Umar   Logistics    I      M      87   30 2021-05-14
21     Vera   Logistics    I      F      79   31 2021-06-10
22   Walter     Support    J      M      66   24 2020-11-25
23    Xenia     Support    J      F      71   26 2020-12-30
24    Yasir     Support    J      M      69   25 2021-01-08
25     Zara     Support    J      F      73   27 2021-01-22
26    Adnan       Legal    K      M     120   38 2022-02-15
27    Bella       Legal    K      F     115   36 2022-03-10
28    Cyrus       Legal    K      M     118   37 2022-04-05
29      Dua       Legal    K      F     122   35 2022-04-18

### Department Wise Mean Salary

In [38]:
df.groupby("Department")["Salary"].mean()

Department
Admin          70.666667
Finance        91.333333
HR             87.500000
IT             81.500000
Legal         118.750000
Logistics      83.000000
Marketing      90.000000
Operations     72.666667
R&D           110.000000
Sales          77.500000
Support        69.750000
Name: Salary, dtype: float64

In [39]:
df.groupby("Gender")["Salary"].mean()

Gender
F    85.066667
M    90.066667
Name: Salary, dtype: float64

In [40]:
df.groupby("Department")["Salary"].sum()

Department
Admin         212
Finance       274
HR            175
IT            163
Legal         475
Logistics     166
Marketing     180
Operations    218
R&D           330
Sales         155
Support       279
Name: Salary, dtype: int64

In [41]:
df.groupby("Department")["Salary"].min()

Department
Admin          68
Finance        88
HR             85
IT             78
Legal         115
Logistics      79
Marketing      88
Operations     70
R&D           105
Sales          75
Support        66
Name: Salary, dtype: int64

In [42]:
df.groupby("Department")["Salary"].max()

Department
Admin          74
Finance        95
HR             90
IT             85
Legal         122
Logistics      87
Marketing      92
Operations     76
R&D           115
Sales          80
Support        73
Name: Salary, dtype: int64

In [43]:
std = df.groupby("Department")["Salary"].std()
print(std)

Department
Admin         3.055050
Finance       3.511885
HR            3.535534
IT            4.949747
Legal         2.986079
Logistics     5.656854
Marketing     2.828427
Operations    3.055050
R&D           5.000000
Sales         3.535534
Support       2.986079
Name: Salary, dtype: float64

In [44]:
df.groupby("Department")["Salary"].count()

Department
Admin         3
Finance       3
HR            2
IT            2
Legal         4
Logistics     2
Marketing     2
Operations    3
R&D           3
Sales         2
Support       4
Name: Salary, dtype: int64

In [45]:
type(df.groupby("Department")["Salary"].agg(["mean", "max", "min"]))

pandas.core.frame.DataFrame

In [46]:
df.groupby("Department")["Salary"].agg(avg_score="mean",high_score="max")

             avg_score  high_score
Department
Admin        70.666667          74
Finance      91.333333          95
HR           87.500000          90
IT           81.500000          85
Legal       118.750000         122
Logistics    83.000000          87
Marketing    90.000000          92
Operations   72.666667          76
R&D         110.000000         115
Sales        77.500000          80
Support      69.750000          73

In [47]:
df["Salary Avg"] = df.groupby("Department")["Salary"].transform("mean")

In [48]:
df

       Name  Department Team Gender  Salary  Age   JoinDate  Salary Avg
0     Alice          HR    A      M      85   23 2020-01-10   87.500000
1       Bob          HR    A      F      90   25 2020-02-15   87.500000
2   Charlie          IT    B      M      78   30 2021-03-20   81.500000
3     Diana          IT    B      F      85   22 2021-04-10   81.500000
4     Ethan   Marketing    C      M      92   28 2020-05-30   90.000000
5     Fiona   Marketing    C      F      88   26 2020-06-25   90.000000
6    George       Sales    D      M      75   21 2021-07-15   77.500000
7    Hannah       Sales    D      F      80   27 2021-08-01   77.500000
8       Ian     Finance    E      M      95   32 2020-09-05   91.333333
9     Julia     Finance    E      F      88   29 2021-01-12   91.333333
10    Kevin     Finance    E      M      91   31 2021-02-18   91.333333
11    Laura  Operations    F      F      72   24 2020-03-05   72.666667
12  Michael  Operations    F      M      76   26 2020-04-17   72.666667
13     Nina  Operations    F      F      70   23 2020-04-28   72.666667
14    Oscar         R&D    G      M     110   34 2021-10-11  110.000000
15    Paula         R&D    G      F     105   33 2021-11-01  110.000000
16  Quentin         R&D    G      M     115   35 2021-12-14  110.000000
17     Riya       Admin    H      F      68   28 2020-07-19   70.666667
18      Sam       Admin    H      M      74   27 2020-08-03   70.666667
19     Tina       Admin    H      F      70   25 2020-08-20   70.666667
20     Umar   Logistics    I      M      87   30 2021-05-14   83.000000
21     Vera   Logistics    I      F      79   31 2021-06-10   83.000000
22   Walter     Support    J      M      66   24 2020-11-25   69.750000
23    Xenia     Support    J      F      71   26 2020-12-30   69.750000
24    Yasir     Support    J      M      69   25 2021-01-08   69.750000
25     Zara     Support    J      F      73   27 2021-01-22   69.750000
26    Adnan       Legal    K      M     120   38 2022-02-15  118.750000
27    Bella       Legal    K      F     115   36 2022-03-10  118.750000
28    Cyrus       Legal    K      M     118   37 2022-04-05  118.750000
29      Dua       Legal    K      F     122   35 2022-04-18  118.750000

In [49]:
# Filtering
df.groupby("Department").filter(lambda x:x["Salary"].mean() >90)

       Name Department Team Gender  Salary  Age   JoinDate  Salary Avg
8       Ian    Finance    E      M      95   32 2020-09-05   91.333333
9     Julia    Finance    E      F      88   29 2021-01-12   91.333333
10    Kevin    Finance    E      M      91   31 2021-02-18   91.333333
14    Oscar        R&D    G      M     110   34 2021-10-11  110.000000
15    Paula        R&D    G      F     105   33 2021-11-01  110.000000
16  Quentin        R&D    G      M     115   35 2021-12-14  110.000000
26    Adnan      Legal    K      M     120   38 2022-02-15  118.750000
27    Bella      Legal    K      F     115   36 2022-03-10  118.750000
28    Cyrus      Legal    K      M     118   37 2022-04-05  118.750000
29      Dua      Legal    K      F     122   35 2022-04-18  118.750000

In [50]:
df[df["Salary"] >92]

       Name Department Team Gender  Salary  Age   JoinDate  Salary Avg
8       Ian    Finance    E      M      95   32 2020-09-05   91.333333
14    Oscar        R&D    G      M     110   34 2021-10-11  110.000000
15    Paula        R&D    G      F     105   33 2021-11-01  110.000000
16  Quentin        R&D    G      M     115   35 2021-12-14  110.000000
26    Adnan      Legal    K      M     120   38 2022-02-15  118.750000
27    Bella      Legal    K      F     115   36 2022-03-10  118.750000
28    Cyrus      Legal    K      M     118   37 2022-04-05  118.750000
29      Dua      Legal    K      F     122   35 2022-04-18  118.750000

In [51]:
df[df["Salary"] >=df["Salary Avg"]]

       Name  Department Team Gender  Salary  Age   JoinDate  Salary Avg
1       Bob          HR    A      F      90   25 2020-02-15   87.500000
3     Diana          IT    B      F      85   22 2021-04-10   81.500000
4     Ethan   Marketing    C      M      92   28 2020-05-30   90.000000
7    Hannah       Sales    D      F      80   27 2021-08-01   77.500000
8       Ian     Finance    E      M      95   32 2020-09-05   91.333333
12  Michael  Operations    F      M      76   26 2020-04-17   72.666667
14    Oscar         R&D    G      M     110   34 2021-10-11  110.000000
16  Quentin         R&D    G      M     115   35 2021-12-14  110.000000
18      Sam       Admin    H      M      74   27 2020-08-03   70.666667
20     Umar   Logistics    I      M      87   30 2021-05-14   83.000000
23    Xenia     Support    J      F      71   26 2020-12-30   69.750000
25     Zara     Support    J      F      73   27 2021-01-22   69.750000
26    Adnan       Legal    K      M     120   38 2022-02-15  118.750000
29      Dua       Legal    K      F     122   35 2022-04-18  118.750000

In [52]:
df[df["Department"] == "Legal"]

     Name Department Team Gender  Salary  Age   JoinDate  Salary Avg
26  Adnan      Legal    K      M     120   38 2022-02-15      118.75
27  Bella      Legal    K      F     115   36 2022-03-10      118.75
28  Cyrus      Legal    K      M     118   37 2022-04-05      118.75
29    Dua      Legal    K      F     122   35 2022-04-18      118.75

In [53]:
female_emp = df[df["Gender"].isin(["F"])]
female_emp

      Name  Department Team Gender  Salary  Age   JoinDate  Salary Avg
1      Bob          HR    A      F      90   25 2020-02-15   87.500000
3    Diana          IT    B      F      85   22 2021-04-10   81.500000
5    Fiona   Marketing    C      F      88   26 2020-06-25   90.000000
7   Hannah       Sales    D      F      80   27 2021-08-01   77.500000
9    Julia     Finance    E      F      88   29 2021-01-12   91.333333
11   Laura  Operations    F      F      72   24 2020-03-05   72.666667
13    Nina  Operations    F      F      70   23 2020-04-28   72.666667
15   Paula         R&D    G      F     105   33 2021-11-01  110.000000
17    Riya       Admin    H      F      68   28 2020-07-19   70.666667
19    Tina       Admin    H      F      70   25 2020-08-20   70.666667
21    Vera   Logistics    I      F      79   31 2021-06-10   83.000000
23   Xenia     Support    J      F      71   26 2020-12-30   69.750000
25    Zara     Support    J      F      73   27 2021-01-22   69.750000
27   Bella       Legal    K      F     115   36 2022-03-10  118.750000
29     Dua       Legal    K      F     122   35 2022-04-18  118.750000

In [54]:
female_emp[female_emp["Salary"] > female_emp["Salary Avg"]]

      Name Department Team Gender  Salary  Age   JoinDate  Salary Avg
1      Bob         HR    A      F      90   25 2020-02-15       87.50
3    Diana         IT    B      F      85   22 2021-04-10       81.50
7   Hannah      Sales    D      F      80   27 2021-08-01       77.50
23   Xenia    Support    J      F      71   26 2020-12-30       69.75
25    Zara    Support    J      F      73   27 2021-01-22       69.75
29     Dua      Legal    K      F     122   35 2022-04-18      118.75

In [55]:
df[df["Name"] == "Dua"]

   Name Department Team Gender  Salary  Age   JoinDate  Salary Avg
29  Dua      Legal    K      F     122   35 2022-04-18      118.75

In [56]:
df[(df["Salary"] > 90) & (df["Gender"] == "F")]

     Name Department Team Gender  Salary  Age   JoinDate  Salary Avg
15  Paula        R&D    G      F     105   33 2021-11-01      110.00
27  Bella      Legal    K      F     115   36 2022-03-10      118.75
29    Dua      Legal    K      F     122   35 2022-04-18      118.75

In [57]:
employee = pd.DataFrame({
    "EmpID": [1,2,3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10,20,30]
})

In [58]:
employee

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [59]:
departments = pd.DataFrame({
    "DeptID": [10,20,40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [60]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [61]:
pd.merge(employee, departments, on="DeptID") #iNNER Joint

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [62]:
 pd.merge(employee, departments, on="DeptID", how="left") #left Joint

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [63]:
pd.merge(employee, departments, on="DeptID", how="right") #right Joint

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [64]:
pd.merge(employee, departments, on="DeptID", how="outer") #outer Joint

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [65]:
pd.concat([employee, departments])

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10          NaN
1    2.0      Bob      20          NaN
2    3.0  Charlie      30          NaN
0    NaN      NaN      10           HR
1    NaN      NaN      20  Engineering
2    NaN      NaN      40    Marketing

In [66]:
pd.concat([employee, departments], axis=1)

   EmpID     Name  DeptID  DeptID     DeptName
0      1    Alice      10      10           HR
1      2      Bob      20      20  Engineering
2      3  Charlie      30      40    Marketing